# STOR 320: Introduction to Data Science
# Lab 4

**Name:** Robert Nachnani

**Instructions:** Fill in the blanks as necessary and complete the questions below.

Remember to submit the lab to gradescope.

In [8]:
# Just run this cell
import numpy as np
import pandas as pd

rng = np.random.default_rng(42)

## Handling Missing Data

**0. What are the two main approaches to dealing with missing data and a trade-off of each?**

Answer: The main approaches to dealing with missing data are removing missing values, which can lead to loss of data, and imputing them, which might introduce bias​ into our data.

**1. What are the two modes of storing and manipulating null data in Pandas?**

Answer Pandas can store data using either the NaN for numbers or None for objects.

**2. Any array containing `None` must have what dtype?**

Answer: It must have dtype = object since object arrays can hold mixed data types.

**3. Run the cells below. Why does the operation on `dtype=object` take so much longer than `dtype=int`?**

In [9]:
%timeit np.arange(1E6, dtype=int).sum()

6.16 ms ± 201 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [10]:
%timeit np.arange(1E6, dtype=object).sum()

210 ms ± 4.56 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

Answer: Because dtype=object is being treated as an object which takes longer to process.

**4. Try to run the code cells below. Why does the `.sum()` call on `vals1` throw an error?**

In [11]:
# Create an array with None object
vals1 = np.array([1, None, 2, 3])
vals1

array([1, None, 2, 3], dtype=object)

In [12]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

Answer: Because we have None in our array which is for objects and not numerical values meaning it cannot be summed like a float or int.

**5. What is the main downside to `NaN`?**

Answer: It works with calculations meaning we can have skewed data that we may not want.

**6. Run the code cells below. What two changes did Pandas automatically make when you ran `x[0] = None`? Why?**

In [13]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [14]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

Answer: It made the value for 0 = to None and it made the value for 1 = 1.0 which is a float.  This is due to it not supporting none in integer arrays.

**7. Fill in the blank:** 
In Pandas, strings are always stored with a/an _________ dtype.

Answer: Object

**8. You are given the following DataFrame `df` which contains information about students' test scores in different subjects. Some of the data is missing.**

1. Count the number of missing values in each column and display the missing counts.
2. Fill the missing values in the 'Math' column with the median value of the 'Math' column and display `df`.
3. Fill missing values in the 'Science' and 'History' columns with the mean value of their respective columns and display `df`. There should only be one null value left in `df`.
4. Create a new column 'Total_Score' which is the sum of the scores in all subjects for each student. Handle missing values by treating them as zeros in the summation. Display `df`.
5. Interpolate missing value linearly in the 'English' column. Display `df`. Explain the difference between forward fill and linear interpolation and what would have resulted if we would have used forward fill instead of interpolation. Hint: Look at using `.interpolate`

In [15]:
data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Math': [85, 92, np.nan, 74, np.nan],
    'Science': [np.nan, 88, 93, 81, np.nan],
    'English': [79, np.nan, 85, 90, 87],
    'History': [88, 76, np.nan, np.nan, 80]
}

df = pd.DataFrame(data)
df

   Student  Math  Science  English  History
0    Alice  85.0      NaN     79.0     88.0
1      Bob  92.0     88.0      NaN     76.0
2  Charlie   NaN     93.0     85.0      NaN
3    David  74.0     81.0     90.0      NaN
4      Eve   NaN      NaN     87.0     80.0

In [19]:
# Code Solution Here
nan_count = df.isna().sum
print(nan_count)

<bound method DataFrame.sum of    Student   Math  Science  English  History
0    False  False     True    False    False
1    False  False    False     True    False
2    False   True    False    False     True
3    False  False    False    False     True
4    False   True     True    False    False>

In [20]:
df['Math'] = df['Math'].fillna(df['Math'].median())
df

   Student  Math  Science  English  History
0    Alice  85.0      NaN     79.0     88.0
1      Bob  92.0     88.0      NaN     76.0
2  Charlie  85.0     93.0     85.0      NaN
3    David  74.0     81.0     90.0      NaN
4      Eve  85.0      NaN     87.0     80.0

In [24]:
df['Science'] = round(df['Science'].fillna(df['Science'].mean()), 1)
df['History'] = round(df['History'].fillna(df['History'].mean()), 1)
df

   Student  Math  Science  English  History
0    Alice  85.0     87.3     79.0     88.0
1      Bob  92.0     88.0      NaN     76.0
2  Charlie  85.0     93.0     85.0     81.3
3    David  74.0     81.0     90.0     81.3
4      Eve  85.0     87.3     87.0     80.0

In [25]:
df['Total_Score'] = df[['Math', 'Science', 'English', 'History']].fillna(0).sum(axis=1)
df

   Student  Math  Science  English  History  Total_Score
0    Alice  85.0     87.3     79.0     88.0        339.3
1      Bob  92.0     88.0      NaN     76.0        256.0
2  Charlie  85.0     93.0     85.0     81.3        344.3
3    David  74.0     81.0     90.0     81.3        326.3
4      Eve  85.0     87.3     87.0     80.0        339.3

In [26]:
df['English'] = df['English'].interpolate()
df

   Student  Math  Science  English  History  Total_Score
0    Alice  85.0     87.3     79.0     88.0        339.3
1      Bob  92.0     88.0     82.0     76.0        256.0
2  Charlie  85.0     93.0     85.0     81.3        344.3
3    David  74.0     81.0     90.0     81.3        326.3
4      Eve  85.0     87.3     87.0     80.0        339.3

## Heirarchical Indexing

**9. Run the code cell below. What do the blank values in the first column represent in the hierarchical representation of the data?**

In [28]:
# Use Python tuples as keys
index = [('California', 2010), ('California', 2020),
         ('New York', 2010), ('New York', 2020),
         ('Texas', 2010), ('Texas', 2020)]

populations = [37253956, 39538223,
               19378102, 20201249,
               25145561, 29145505]
pop = pd.Series(populations, index=index)
pop

# Create a multi-index from the tuples
index = pd.MultiIndex.from_tuples(index)

# Hierarchical representation of the data
pop = pop.reindex(index)
pop

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

Answer: The blank values represent repeated values in the first column.

**10. You are given the following MultiIndexed Series sales which contains quarterly sales data for different regions and products.**

1. Display the sales data for 'North' region.
2. Display the sales data for 'Product_B' across all regions.
3. Display the sales data for 'North' region and 'Product_A'.
4. Display the sales data for 'South' and 'West' regions only.
5. Display the sales data for 'North' and 'South' regions and 'Product_B'.

In [29]:
index = pd.MultiIndex.from_product(
    [['North', 'South', 'East', 'West'], ['Product_A', 'Product_B']],
    names=['Region', 'Product']
)

data = [150, 200, 100, 220, 130, 190, 170, 210]

sales = pd.Series(data, index=index)
sales

Region  Product
North   Product_A    150
        Product_B    200
South   Product_A    100
        Product_B    220
East    Product_A    130
        Product_B    190
West    Product_A    170
        Product_B    210
dtype: int64

In [30]:
# Code Solution Here
sales['North']

Product
Product_A    150
Product_B    200
dtype: int64

In [33]:
sales.loc[: , 'Product_B']

Region
North    200
South    220
East     190
West     210
dtype: int64

In [34]:
sales.loc['North' , 'Product_A']

150

In [35]:
sales.loc[['South' , 'West']]

Region  Product
South   Product_A    100
        Product_B    220
West    Product_A    170
        Product_B    210
dtype: int64

In [36]:
sales.loc[['North' , 'South'] , 'Product_B']

Region  Product
North   Product_B    200
South   Product_B    220
dtype: int64

**11. The code below throws an errors because we cannot slice within a tuple. Provide the correct version of the code and explain what the code is doing.**

In [49]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                            names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'],
                                      ['HR', 'Temp']],
                                       names=['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)

# try to slice the DataFrame
health_data.loc[(:,  1), (:, 'HR')]

SyntaxError: invalid syntax (575983813.py, line 16)

In [50]:
# Code Solution Here
health_data.loc[(slice(None), 1), (slice(None), 'HR')]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      28.0  46.0  43.0
2014 1      39.0  41.0  35.0

Answer: You cannot slice using the .loc method, you have to slice both the column and the row in order to get the outcome you desire.

**12. Fill in the blank:** Partial slices and other similar operations require the levels in the `MultiIndex` to be in sorted (i.e., ________________) order.

Answer: Lexicographic

**13. What does the `level=0` vs. `level=1` parameter change in the `.unstack()` function?**

Answer: level = 0 unpacks the outermost index into columns while level = 1 unpacks the second level of the index into columns

**14. You are given the following MultiIndexed DataFrame sales_data which contains quarterly sales data for different products across multiple regions and years. You should use the original `sales_data` DataFrame to perform each task.**

1. Unstack the 'Region' level and display the resulting DataFrame.
2. Swap the levels 'Year' and 'Region' and display the resulting DataFrame. Hint: Look at using `.swaplevels`
3. Slice the data to retrieve sales information for 'Product_A' in the 'South' region for the year 2020 for quarters Q2 and Q3. Display your answer.

In [61]:
index = pd.MultiIndex.from_product(
    [['2019', '2020'], ['North', 'South'], ['Product_A', 'Product_B'], ['Q1', 'Q2', 'Q3', 'Q4']],
    names=['Year', 'Region', 'Product', 'Quarter']
)

data = np.random.randint(100, 1000, size=(32, 1))

sales_data = pd.DataFrame(data, index=index, columns=['Sales'])

In [62]:
# Code Solution Here
sales_data.unstack('Region')

                       Sales
Region                 North South
Year Product   Quarter
2019 Product_A Q1        331   992
               Q2        942   998
               Q3        209   892
               Q4        693   439
     Product_B Q1        441   641
               Q2        975   155
               Q3        805   153
               Q4        680   777
2020 Product_A Q1        899   960
               Q2        177   902
               Q3        880   475
               Q4        293   464
     Product_B Q1        860   807
               Q2        329   470
               Q3        243   765
               Q4        399   825

In [63]:
sales_data.swaplevel('Year' , 'Region')

                               Sales
Region Year Product   Quarter
North  2019 Product_A Q1         331
                      Q2         942
                      Q3         209
                      Q4         693
            Product_B Q1         441
                      Q2         975
                      Q3         805
                      Q4         680
South  2019 Product_A Q1         992
                      Q2         998
                      Q3         892
                      Q4         439
            Product_B Q1         641
                      Q2         155
                      Q3         153
                      Q4         777
North  2020 Product_A Q1         899
                      Q2         177
                      Q3         880
                      Q4         293
            Product_B Q1         860
                      Q2         329
                      Q3         243
                      Q4         399
South  2020 Product_A Q1         960
                      Q2         902
                      Q3         475
                      Q4         464
            Product_B Q1         807
                      Q2         470
                      Q3         765
                      Q4         825

In [66]:
sales_data.loc[('2020', 'South', 'Product_A', ['Q2', 'Q3'])]

                               Sales
Year Region Product   Quarter
2020 South  Product_A Q2         902
                      Q3         475